wintersmith/contents/articles/linux/2013-06-07-git-best-practical.html
---
date: 2013-06-07
template: tech.jade
title: git 使用常见问题解决方法
category: Linux
tag: linux,git
change_frequency: monthly
---
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">查询Ref对应的Commit ID</a></li>
<li><a href="#sec-2">撤销commit</a></li>
<li><a href="#sec-3">强制使用远端仓库的内容</a></li>
<li><a href="#sec-4">删除tag，并删除远程tag</a></li>
<li><a href="#sec-5">添加tag，并推送到远程</a></li>
<li><a href="#sec-6">修改上次的commit message</a></li>
<li><a href="#sec-7">修改上次的commit author</a></li>
<li><a href="#sec-8">删除未跟踪(Untracked)的文件</a></li>
<li><a href="#sec-9">强制覆盖远程</a></li>
<li><a href="#sec-10">merge远程机器commit</a></li>
<li><a href="#sec-11">解决合并产生的冲突</a></li>
<li><a href="#sec-12">查看某个文件某个commit的内容</a></li>
<li><a href="#sec-13">配置</a></li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">查询Ref对应的Commit ID</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">

<pre class="src src-sh">git rev-parse HEAD #查询HEAD对应的commit ID
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">撤销commit</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">

<pre class="src src-sh">git reset --soft &lt;COMMIT_ID&gt;
</pre>
</div>
<p>
这条命令撤销_COMMIT_ID_之后的所有提交，但保持所有的更改
</p>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">强制使用远端仓库的内容</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">

<pre class="src src-sh">git reset --hard origin/master
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">删除tag，并删除远程tag</h2>
<div class="outline-text-2" id="text-4">
<div class="org-src-container">

<pre class="src src-sh">git tag -d &lt;TAG_A&gt;
git push origin :refs/tags/&lt;TAG_A&gt;
</pre>
</div>
<p>
tag 和branch类似，可以看做一种特殊branch
</p>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">添加tag，并推送到远程</h2>
<div class="outline-text-2" id="text-5">
<div class="org-src-container">

<pre class="src src-sh">git tag &lt;TAG_A&gt;
git push --tags
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6">修改上次的commit message</h2>
<div class="outline-text-2" id="text-6">
<div class="org-src-container">

<pre class="src src-sh">git commit --amend
</pre>
</div>
<p>
会跳出一个编辑器，可以编辑上次的commit 信息，然后保存即修改完成
</p>
</div>
</div>
<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7">修改上次的commit author</h2>
<div class="outline-text-2" id="text-7">
<div class="org-src-container">

<pre class="src src-sh">git commit --amend --author 'New Author Name &lt;email@address.com&gt;'
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8">删除未跟踪(Untracked)的文件</h2>
<div class="outline-text-2" id="text-8">
<div class="org-src-container">

<pre class="src src-sh">git clean -f
</pre>
</div>
<p>
git clean 删除没有纳入git管理的文件
</p>
</div>
</div>
<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9">强制覆盖远程</h2>
<div class="outline-text-2" id="text-9">
<div class="org-src-container">

<pre class="src src-sh">git push --force origin/master
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10">merge远程机器commit</h2>
<div class="outline-text-2" id="text-10">
<div class="org-src-container">

<pre class="src src-sh">git fetch ssh://root@hosta.com/root/account &amp;&amp; git merge FETCH_HEAD
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-11" class="outline-2">
<h2 id="sec-11">解决合并产生的冲突</h2>
<div class="outline-text-2" id="text-11">
<div class="org-src-container">

<pre class="src src-sh">grep -lr "&lt;&lt;&lt;&lt;&lt;" | xargs git checkout --ours
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-12" class="outline-2">
<h2 id="sec-12">查看某个文件某个commit的内容</h2>
<div class="outline-text-2" id="text-12">
<div class="org-src-container">

<pre class="src src-sh">git cat-file blob 42f70347905ce30435459d3e114f30bb5d3084f4:compile.sh
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-13" class="outline-2">
<h2 id="sec-13">配置</h2>
<div class="outline-text-2" id="text-13">
<ul class="org-ul">
<li>全局配置文件
~/.gitconfig
</li>
<li>查看配置
<div class="org-src-container">

<pre class="src src-sh">git config -l
</pre>
</div>
</li>
<li>开启色彩
<div class="org-src-container">

<pre class="src src-sh">git config --global  color.ui true
</pre>
</div>
</li>
<li>diff 颜色
<div class="org-src-container">

<pre class="src src-sh">git config --global color.diff auto
</pre>
</div>
</li>
</ul>
</div>
</div>
